РП/src/Catalogs/СоответствияОборотовМеждународногоУчета/СоответствияОборотовМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствияОборотовМеждународногоУчета</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СчетРеглУчетаДт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРеглУчетаКт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетМеждународногоУчетаДт</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетМеждународногоУчетаКт</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленДополнительныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыСовместногоПримененияШаблоновПроводок</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеУточнениеПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтражаетсяВМеждународномУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияСубконто</name>
    <attributes>
      <name>ПоложениеСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполнятьИзРеглУчета</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УказанноеЗначение</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Выражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Catalogs/СоответствияОборотовМеждународногоУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает схему компоновки данных для настройки соответствия оборотов
//
// Параметры
// 	СчетДт - ПланСчетовСсылка.Хозрасчетный - СчетДт оборота регл. учета
// 	СчетКт - ПланСчетовСсылка.Хозрасчетный - СчетКт оборота регл. учета
//
// ВозвращаемоеЗначение:
// 	СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема, применяемая для настройки соответствия оборотов
//
Функция СхемыКомпоновкиДанных(СчетРеглУчетаДт, СчетРеглУчетаКт) Экспорт
	
	СхемаКомпоновкиДанных = Справочники.СоответствияОборотовМеждународногоУчета.ПолучитьМакет("СхемаКомпоновкиДанных");
	ПоляНабора = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(СчетРеглУчетаДт);
	МассивСчетов.Добавить(СчетРеглУчетаКт);
	РеквизитыСчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСчетов, "Код, Наименование");
	
	Счета = Новый Структура;
	Счета.Вставить("Дт", СчетРеглУчетаДт);
	Счета.Вставить("Кт", СчетРеглУчетаКт);
	Для каждого Счет Из Счета Цикл
		
		Если Не ЗначениеЗаполнено(Счет.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		ПоложениеСчета = Счет.Ключ;
		ПолеГруппа = ПоляНабора.Найти("Счет" + ПоложениеСчета);
		РеквизитыСчета = РеквизитыСчетов[Счет.Значение];
		ПолеГруппа.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								"%1, %2", РеквизитыСчета.Код, РеквизитыСчета.Наименование);
		
		ВидыСубконто = ФинансоваяОтчетностьПовтИсп.ВидыСубконтоСчета(Счет.Значение);
		Для НомерСубконто = 1 По 3 Цикл
			ПутьКДанным = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							"Счет%1.Субконто%1%2", ПоложениеСчета, НомерСубконто);
			Поле = ПоляНабора.Найти(ПутьКДанным);
			СтрокаВидСубконто = ВидыСубконто.Найти(НомерСубконто, "НомерСубконто");
			Если СтрокаВидСубконто <> Неопределено Тогда
				Поле.Заголовок = Строка(СтрокаВидСубконто.ВидСубконто);
				Поле.ТипЗначения = СтрокаВидСубконто.ТипЗначения;
			Иначе
				Поле.ОграничениеИспользования.Условие = Истина;
				Поле.ОграничениеИспользованияРеквизитов.Условие = Истина;
				Поле.ОграничениеИспользования.Поле = Истина;
				Поле.ОграничениеИспользованияРеквизитов.Поле = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
